// Desenvolva aqui o menu para interagir com o usuário em JS
import * as readline from "readline-sync";
// const banner = `
// ╔══════════════════════════════════════════════════════╗
// ║                                                      ║
// ║   ░░░░░░░░░░░░░░░░░ BEM-VINDO AO ░░░░░░░░░░░░░░░░░   ║
// ║                                                      ║
// ║            ███╗   ███╗ ██████╗ ███████╗              ║
// ║            ████╗ ████║██╔═══██╗██╔════╝              ║
// ║            ██╔████╔██║██║   ██║█████╗                ║
// ║            ██║╚██╔╝██║██║   ██║██╔══╝                ║
// ║            ██║ ╚═╝ ██║╚██████╔╝███████╗              ║
// ║            ╚═╝     ╚═╝ ╚═════╝ ╚══════╝              ║
// ║                                                      ║
// ║             ------- MONSTER HELL -------             ║
// ║                                                      ║
// ╚══════════════════════════════════════════════════════╝
// `;

const banner_inicial = `
╔═════════════════════════════════════════════════╗
║        ⚔️  BKR: Battle Knights Reborn ⚔️          ║ 
╠═════════════════════════════════════════════════╣
║       🌙 Bem-vindo à era das lendas! 🌙         ║
╚═════════════════════════════════════════════════╝
`;
console.log(banner_inicial);

const banner_escolha = `
╔══════════════════════════════════════════════════════════════════╗
║                  ⚔️ BKR: Battle Knights Reborn ⚔️                  ║
╠══════════════════════════════════════════════════════════════════╣
║             🌟 Escolha o seu destino, guerreiro! 🌟              ║
╠══════════════════════════════════════════════════════════════════╣
║                          (1) 🏰 Herói                             ║
║                          (2) 👹 Monstro                          ║
╚══════════════════════════════════════════════════════════════════╝
`;
console.log(banner_escolha);
let escolha_classe = readline.questionInt("Digite o número que corresponde à sua escolha: ")